////============================================================================
////文件名称：wdog.c
////功能概要：K60 看门狗驱动程序程序源文件
////=================苏州大学飞思卡尔嵌入式中心2012==========================
//
#include "wdog.h"    //包含wdog.h头文件

//=========================================================================
//函数名称：wdog_start
//功能概要：启动看门狗模块
//参数说明：无
//函数返回：无
//默认时钟选择LPO，而不选择BUS
//选择总线时钟，复位时间可以是0.17ms、1.36ms、5.46ms
//选择LPO时钟，复位时间可以是32ms、256ms、1024ms
//=========================================================================
void wdog_start(uint32_t timeout)
{
    switch(timeout)
    {
        case TIMEOUT1:
            SIM_COPC |= SIM_COPC_COPT(1);
            break;
        case TIMEOUT2:
            SIM_COPC |= SIM_COPC_COPT(2);
            break;
        case TIMEOUT3:
        default:
            SIM_COPC |= SIM_COPC_COPT(3);
            break;
    }
}

//=========================================================================
//函数名称：wdog_stop
//功能概要：禁用看门狗模块
//参数说明：无
//函数返回：无
//=========================================================================
void wdog_stop()
{
    SIM_COPC &= ~SIM_COPC_COPT_MASK;
}

//=========================================================================
//函数名称：wdog_feed
//功能概要：喂狗，清看门狗计数器，使该计数器重启
//参数说明：无
//函数返回：无
//复位序列：先写0x55，后写0xAA
//=========================================================================
void wdog_feed(void)
{
    SIM_SRVCOP = 0x55;
    SIM_SRVCOP = 0xAA;
}


