//==========================================================================
//文件名称：systick.h
//功能概要：systick 构件头文件
//版权所有：苏州大学嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2017-11-08   V1.0
//==========================================================================

#ifndef SYSTICK_H
#define SYSTICK_H

#include "mcu.h"     //包含公共要素头文件

//===========================================================================
//函数名称：systick_init
//函数返回：无
//参数说明：int_ms:中断的时间间隔(1~5000ms)
//功能概要：初始化SysTick模块，设置中断的时间间隔
//简要说明：使用内核时钟，其频率SYSTEM_CLK_KHZ在common.h中宏定义
//===========================================================================
void systick_init(uint8_t int_ms);


#endif //SYSTICK_H
