//NumToStr.h

#ifndef NUMTOSTR_H    //防止重复定义（ 开头）
#define NUMTOSTR_H

#include "cpu.h"

//=====================================================================
//函数名称：NumToStr_int
//函数返回：转换完成后所得到的字符串首地址，以'\0'结尾
//参数说明：x：待转换为字符串的数字；
//         buf：字符串转换完成后存储的位置；
//功能概要：将整数转为字符串
//=====================================================================
uint8_t *NumToStr_int(int32_t x,char *buf);


//================================================================
//函数名称：NumToStr_float
//函数返回：转换完成后所得到的字符串首地址，以'\0'结尾
//参数说明：x：待转换的双精度浮点数；
//          m：转换后保留小数的位数；
//          buf：字符串转换完成后存储的位置；
//功能概要：将浮点数转为字符串
//=================================================================
char *NumToStr_float(float x,int num,char *buf);


#endif      //防止重复定义（ 结尾）

